tangguangyue.org
* 汤光月的emacs配置
** 初始化所有的packages
#+BEGIN_SRC emacs-lisp
(package-initialize)
#+END_SRC

** 配置loadPath
#+BEGIN_SRC emacs-lisp

(require 'cask "~/.cask/cask.el")
(cask-initialize)

(require 'pallet)
(pallet-mode t)

;; 加载路径
(add-to-list 'load-path "~/.emacs.d/aplgsd/")

(defun open-my-init-file()
  (interactive)
  (find-file "~/.emacs.d/init.el"))

;; add more personal funcall
;; new init-func.el

;; 加载包
;; (require 'init-func.el)
(require 'init-packages)
(require 'init-ui)
(require 'init-better-defaults)
(require 'init-org)
(require 'init-program)
(require 'init-keybindings)

;; load-file and load
(setq custom-file (expand-file-name "aplgsd/custom.el" user-emacs-directory))

(load-file custom-file)
#+END_SRC

** 让选中一段文本后，可以直接输入覆盖
#+BEGIN_SRC emacs-lisp
(delete-selection-mode t)
#+END_SRC
